<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

class StaticController extends Controller
{

    public static function fakeArrayData()
    {
        $city = [
            'ເມືອງຈັນທະບູລີ',
            'ເມືອງສີໂຄດຕະບອງ',
            'ເມືອງໄຊເສດຖາ',
            'ເມືອງສີສະຕະນາກ',
            'ເມືອງນາຊາຍທອງ',
            'ເມືອງໄຊທານີ',
            'ເມືອງຫາດຊາຍຟອງ',
            'ເມືອງສັງທອງ',
            'ເມືອງປາກງື່ມ',
            'ເມືອງຜົ້ງສາລີ',
            'ເມືອງໃໝ່',
            'ເມືອງຂວາ',
            'ເມືອງສຳພັນ',
            'ເມືອງບູນເໜືອ',
            'ເມືອງຍອດອູ',
            'ເມືອງຫຼວງນ້ຳທາ',
            'ເມືອງສິງ',
            'ເມືອງລອງ',
            'ເມືອງວຽງພູຄາ',
            'ເມືອງນາແລ',
            'ເມືອງບູນໃຕ້',
            'ເມືອງໄຊ',
            'ເມືອງຫລາ',
            'ເມືອງນາໝໍ້',
            'ເມືອງງາ',
            'ເມືອງແບງ',
            'ເມືອງຮູນ',
            'ເມືອງປາກແບ່ງ',
            'ເມືອງຫ້ວຍຊາຍ',
            'ເມືອງຕົ້ນເຜີ້ງ',
            'ເມືອງເມິງ',
            'ເມືອງຜາອຸດົມ',
            'ເມືອງປາກທາ'
        ];

        $province = [
            'ຜົ້ງສາລີ',
            'ຫຼວງນໍ້າທາ',
            'ຫົວພັນ',
            'ບໍ່ແກ້ວ',
            'ອຸດົມໄຊ',
            'ໄຊຍະບູລີ',
            'ຊຽງຂວາງ',
            'ຫຼວງພະບາງ',
            'ແຂວງວຽງຈັນ',
            'ນະຄອນຫຼວງວຽງຈັນ',
            'ບໍລິຄຳໄຊ',
            'ຄຳມ່ວນ',
            'ສະຫວັນນະເຂດ',
            'ສາລະວັນ',
            'ເຊກອງ',
            'ອັດຕະປື',
            'ແຂວງຈຳປາສັກ',
            'ແຂວງໄຊສົມບູນ',
        ];














        ປໍ້ານໍ້າມັນ ໂພນໄຊ
        ບ້ານ : ໂພນໄຊ, ເມືອງ: ໄຊເສດຖາ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ
        ຕະຫຼາດເຊົ້າ
        ບ້ານ : ຫັດສະດີ, ເມືອງ: ຈັນທະບູລີ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ
        ສຳນັກງານໃຫຍ່1
        ບ້ານ : ຫັດສະດີ, ເມືອງ: ຈັນທະບູລີ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ
        ສຳນັກງານໃຫຍ່ 2
        ບ້ານ : ຫັດສະດີ, ເມືອງ: ຈັນທະບູລີ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ
         ສູນການຄ້າລາວ-ໄອເຕັກ
        ບ້ານ : ໂພນທັນ, ເມືອງ: ໄຊເສດຖາ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ
        ບໍລິສັດລາວໂທລະຄົມ
        ບ້ານ : ສາຍລົມ, ເມືອງ: ຈັນທະບູລີ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ
        ໜ່ວຍບໍລິການສີໄຄ
        ບ້ານ : ສີໄຄ, ເມືອງ: ສີໂຄດຕະບອງ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ
        ໂຮງໝໍ 150 ຕຽງ
        ບ້ານ : ຈອມມະນີ, ເມືອງ: ໄຊເສດຖາ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ
        ບ້ານ ຈອມເພັດ
        ບ້ານ : ຈອມເພັດ, ເມືອງ: ສີສັດຕະນາກ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ
        ໜ່ວຍບໍລິການດົງໂດກ
        ບ້ານ : ຄຳຮຸ່ງ, ເມືອງ: ໄຊທານີ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ
        ຂົວມິດຕະພາບລາວ-ໄທ
        ບ້ານ : ທ່ານາແລ້ງ, ເມືອງ: ຫາດຊາຍຟອງ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ
        ໜ່ວຍບໍລິການດອນໜູນ
        ບ້ານ : ດອນໜູນ, ເມືອງ: ໄຊທານີ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ
        ປໍ້ານໍ້າມັນ PV Oil
        ບ້ານ : ສີຖານີ, ເມືອງ: ສີໂຄດຕະບອງ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ
        ບໍລິສັດລາວໂທລະຄົມ ນ້ໍາພຸ
        ບ້ານ : ຊຽງຍືນ, ເມືອງ: ຈັນທະບູລີ, ແຂວງ: ນຫຼວງວຽງຈັນ
        ເອຊຽນມໍ
        ບ້ານ : ຮ່ອງແກ, ເມືອງ: ໄຊເສດຖາ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ
        ຄີວລົດເມສາຍໄຕ້
        ບ້ານ : ສະພັງເມິກ, ເມືອງ: ໄຊທານີ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ
        LaoVietBank - ສວນເຈົ້າຟ້າງຸ່ມ (ຊ້າງສາມຫົວ)
        ບ້ານ : ສີຖານີ, ເມືອງ: ສີໂຄດຕະບອງ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ
        ວັດຈັນ
        ບ້ານ : ວັດຈັນ, ເມືອງ: ຈັນທະບູລີ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ
        ໂພນປ່າເປົ້າ
        ບ້ານ ໂພນປ່າເປົ້າ, ເມືອງ ສີສັດຕະນາກ, ນະຄອນຫຼວງວຽງຈັນ
        ໂຮງກາຍຍາສີນ
        ໂຮງກາຍຍາສີນ, ບ້ານ ສະຫ່ວາງ, ເມືອງ ຈັນທະບູລີ, ນະຄອນຫຼວງວຽງຈັນ
        ໜ່ວຍບໍລິການລາວໄອເຕັກ
        ບ້ານ ໂພນທັນ, ເມືອງໄຊເສດຖາ, ນະຄອນຫຼວງວຽງຈັນ
        ບໍລິສັດ ທີເອສບີ
        ບ້ານ : ໜອງແຮ້ວ, ເມືອງ: ຫາດຊາຍຟອງ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ
        ບໍລິສັດລາວໂທລະຄົມສຳນັກງານໃຫ່ຍ
        ບ້ານ: ສາຍລົມ, ເມືອງ: ຈັນທະບູລີ, ນະຄອນຫຼວງວຽງຈັນ
        ໜອງທາ
        ບ້ານ ໜອງທາ, ເມືອງ ຈັນທະບູລີ, ນະຄອນຫຼວງວຽງຈັນ
        ຫາດຊາຍຂາວ
        ບ້ານ: ຫາດຊາຍຂາວ, ເມືອງໄຊທານີ, ນະຄອນຫຼວງວຽງຈັນ
        ໜ່ວຍບໍລິການ ວັດໄຕ
        ບ້ານ : ນາຄຳ, ເມືອງ: ສີໂຄດຕະບອງ, ແຂວງ: ນະຄອນຫຼວງວຽງຈັນ




















        $data = [];
        for ($i = 0; $i <= 35; $i++) {
            $data[] = [
                'id' => $i,
                'resName' => 'Soukjai',
                'uploadTime' => strtotime('now'),
                'uploadTimeStamp' => strtotime('now') - mt_rand(1000, 9000),
                'img' => 'http://www.tourismlaos.org/files/images/Laofood-Khaipen.JPG',
                'lovePoint' => mt_rand(0, 1020),
                'address' => [
                    'city' => $city[array_rand($city, 1)],
                    'province' => $province[array_rand($province, 1)],
                    'village' => 'donkoi',
                ],

            ];
        }
        return $data;
    }
}
